import React from 'react';

const About = () => {
    return (
        <div className="container mt-5">
            <h3>About Us</h3>
            <p>
                मंदिर व्यवस्थापन प्रणालीमध्ये आपले स्वागत आहे! आम्ही तुम्हाला आमच्या मंदिराबद्दल आणि सेवांबद्दल माहिती देण्यासाठी समर्पित आहोत. समाजाची सेवा करणे आणि मंदिराचा अनुभव शक्य तितका समृद्ध करणे हे आमचे ध्येय आहे.
            </p>
            <p>
                आपल्या मंदिराला समृद्ध इतिहास आहे आणि ते अध्यात्मिक आणि सांस्कृतिक महत्त्व असलेले ठिकाण आहे. समाजाला एकत्र आणण्यासाठी आम्ही वर्षभर विविध कार्यक्रम, उत्सव आणि कार्यक्रम आयोजित करतो.
            </p>
            <p>
                आमचे मंदिर, त्याचा इतिहास, वेळ, उत्सव आणि आमच्याशी संपर्क कसा साधावा याबद्दल अधिक जाणून घेण्यासाठी कृपया आमच्या वेबसाइटवर मोकळ्या मनाने एक्सप्लोर करा. आम्ही तुमच्या समर्थनाची प्रशंसा करतो आणि तुम्हाला मंदिरात भेटण्यास उत्सुक आहोत!
            </p>
        </div>
    );
};

export default About;
