import React from 'react'

const History = () => {
    return (
        <div>
            <h3>||पंढरपुर महात्म्य ||</h3>
            <h4>* पंढरीचा पौराणिक महिमा *</h4>
            <p>वारकर्‍यांचेच नव्हे, तर अनेक वैष्णवसंप्रदायांचे, केवळ महाराष्ट्रीयांचेच नव्हे तर कर्नाटक, आंध्र, तमिळनाडू, उत्तरप्रदेश, मध्यप्रदेशादि अनेक प्रांतातील अनेक लोकांचे, मराठी भाषिकांचेच नव्हे तर अनेकविध भाषिकांचे परमात्मा पंढरीनाथ हे आराध्य दैवत आहे. अनेक संतानी या देवाचे माहात्म्य गाइलेले आहे. या दैवताची प्राचीनता यांस उपनिषदातील कथासंदर्भाशी जोडणारी आहे. छांदोग्य-उपनिषदाच्या चवथ्या अध्यायात आरंभीच ‘जानश्रुती’ नावाच्या राजाची कथा आली आहे.त्या राजास तो चांदण्याचा आनंद घेत बसला असता, काही हंसांचा संवाद कानावर आला, आकाशमार्गाने जाणारे हे हंस सामान्य कोणी नसून ऋषी होते. त्यांनी आपसात चर्चा चालविली होती. एकाने चंद्रांच्या पडलेल्या टपूर चांदण्याचे वर्णन केले. तेव्हा दुस-याने या चांदण्याहून सौख्यदायी जानश्रुती राजाचे कर्तृत्व असल्याचे सांगितले. तेव्हा अजून एक पक्षी बोलला की, ‘जानश्रुती’ राजाहूनही एक विलक्षण तेजस्वी व्यक्ती जगात आहे,तिचे नांव ‘रैक्व’. हा एक गाडीवान् आहे. पण ब्रम्हज्ञ आहे. जानश्रुतीच्या कानावर हे शब्द पडताच, त्याने या रैक्वाचा अनेक स्थानात शोध चालविला. शेवटी काश्मीरमध्ये हा रैक्व त्याला भेटला. त्या रैक्वाच्या संशोधनप्रसंगी जानश्रुती पंढरीत आल्याचा उल्लेख आहे-</p>
            <h4>ततो निवृत्त आयात: पश्यन्भीमरथीतटे |
                द्विभुजं विठ्ठलं विष्णुं भुक्तिमुक्तिप्रदायकम् |
                यत्र भीमरथीतीरे बिन्दुमाधव संज्ञित:|
                हरि: स वर्ततेSद्यापि भुक्तिमुक्तिप्रदो नृणाम् ||</h4>  <p>पद्यपु.|उत्तरखंड|गीता 6वा अध्याय-माहात्म्य |  ५६,५७,५८ श्लोक,</p>
            <p> अर्थ -    फिरत फिरत तो तेथून निघून भीमरथीच्या तीरावर रैक्वास शोधत निघाला. भीमातीरांवर दोन हातांचा, भोग व मोक्ष देणारा  ‘विठ्ठल’नामक विष्णु जिथे आहे, तिथे तो आला. जिथे बिंदुनामक तीर्थात बिंदुमाधव या नावाने तो परमात्मा भीमातिरी आहे, तेथे तो राजा आला. तिथे माणसांना भोग व मोक्ष देणारा तो देव अद्याप आहे, असा तो उल्लेख आहे.
                या पांडुरंगाचे महात्म्य सांगणारे पौराणिक म्हणवले जाणारे तीन ग्रंथ आहेत. </p>
            <p>             1) पद्यपुराण</p>
            <p>             2) स्कंद पुराण</p>
            <p>             3) विष्णुपुराण</p>
            <p>
                एक पद्यपुराणान्तर्गत वाराहसंहितेल पांडुरंगमाहात्म्य आहे. याची अध्यायसंख्या ३२ व एकूण श्लोकसंख्या साधारणत: १२८९ आहे. सूतऋषी सर्व ऋषींना हे 'पांडुरंगमाहात्म्य' सांगतात. त्यात ते नारदांनी हे पूर्वी शेषास सांगितले आहे, व त्याही अगोदर पूर्वी शंकरांनी ते पार्वतीस सांगितले आहे, असा उल्लेख केला आहे. यात पंढरीत पांडुरंग कसे आले? त्याचे माहात्म्य काय? भीमेची उत्पत्ती कशी झाली? पांडुरंगाच्या पायाखालच्या विटेचा इतिहास काय? चंद्रभागा म्हणजे काय? क्षेत्रातल्या इतर देवता व प्रमुख तीर्थे कोणती? याविषयी बरीच माहिती दिली आहे. पंढरी ही एक यंत्रात्मक नगरी असून या यंत्राच्या मध्यस्थानी पंढरीनाथ विराजमान आहेत व तेथून त्रिकोण-अष्टकोणादी आवरणस्थानात इतर देव आहेत, असे सविस्तर सांगितले आहे. पंढरी म्हणजे काशी, नीरानरसिंहपूर हे प्रयाग व कोर्टी किंवा विष्णुपद हे गयाक्षेत्र आहे, अशी त्रिस्थळीयात्रा पंढरीसंबंधाने वर्णिली आहे. पंढरीतील काशीयात्रेचा विधीही सांगितला आहे. पंढरीत गयाश्राद्ध कसे करावे, याची माहिती दिली आहे.

                दुसरे 'पांडुरंगमाहात्म्य' स्कंदपुराणाच्या उत्तरसंहितेतले असून त्याचे १२ अध्याय आहेत. एकूण श्लोक संख्या साधारणत: ८१३ आहे. यातही स्कंदांना ऋषींनी विचारलेल्या प्रश्नाचे उत्तर देता न आल्याने त्यांनी ऋषींसह कैलासात शंकराकडे जाणे केले. शंकरांना पार्वतीने त्यावेळी तोच प्रश्न विचारला होता. उत्तर द्यायचे चालू होणार, इतक्यात स्कंदांनी ऋषीसंह येऊन तोच प्रश्न विचारल्यावरून शंकरांनी स्कंद, ऋषी व पार्वती सर्वांना पंढरीचा महिमा सांगितला.</p>
        </div >
    )
}

export default History